const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

test('5 + 11 เท่ากับ 16',()=>{
  expect(sum(5,11)).toBe(16);
});

test('99 + 1 เท่ากับ 100',() =>{
  expect(sum(99,1)).toBe(100);
});

test('8 + 12 เท่ากับ 20',()=>{
  expect(sum(8,12)).toBe(20);
});